export default function CyrToLat(word) {
    const a = {};
    a["а"] = "a";    a["б"] = "b";    a["в"] = "v";    a["г"] = "g";    a["д"] = "d";    a["ђ"] = "đ";    
    a["е"] = "e";    a["ж"] = "ž";    a["з"] = "z";    a["и"] = "i";    a["ј"] = "j";    a["к"] = "k";   
    a["л"] = "l";    a["љ"] = "lj";   a["м"] = "m";    a["н"] = "n";    a["њ"] = "nj";   a["о"] = "o";    
    a["п"] = "p";    a["р"] = "r";    a["с"] = "s";    a["т"] = "t";    a["ћ"] = "ć";    a["у"] = "u";    
    a["ф"] = "f";    a["х"] = "h";    a["ц"] = "c";    a["ч"] = "č";    a["џ"] = "dž";   a["ш"] = "š";
    a["А"] = "A";    a["Б"] = "B";    a["В"] = "V";    a["Г"] = "G";    a["Д"] = "D";    a["Ђ"] = "Đ";    
    a["Е"] = "E";    a["Ж"] = "Ž";    a["З"] = "Z";    a["И"] = "I";    a["Ј"] = "J";    a["К"] = "K";   
    a["Л"] = "L";    a["Љ"] = "Lj";   a["М"] = "M";    a["Н"] = "N";    a["Њ"] = "Nj";   a["О"] = "O";    
    a["П"] = "P";    a["Р"] = "R";    a["С"] = "S";    a["Т"] = "T";    a["Ћ"] = "Ć";    a["У"] = "U";    
    a["Ф"] = "F";    a["Х"] = "H";    a["Ц"] = "C";    a["Ч"] = "Č";    a["Џ"] = "Dž";   a["Ш"] = "Š";
    let converted ='';
    for (const i in word){
        if(a[word[i]]!==undefined){
            converted +=(a[word[i]]);
        }
        else{
            converted +=(word[i]);
        }
    }
    return converted;
}

